app/Controllers/Home.php

SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
---
    public function index()
    {
        return view('v_home', [
            'products' => $this->productModel->findAll()
        ]);