app/Controllers/TransaksiController.php

INSERT INTO `transaction` (`username`, `alamat`, `ongkir`, `total_harga`, `ppn`, `biaya_admin`, `kupon_code`, `diskon_kupon`, `status`, `created_at`, `updated_at`) VALUES ('cici82', 'semarang', 73000, 15407260, 0, 355960, 'PROMO2026', 2669700, 0, '2026-07-05 20:49:54', '2026-07-05 20:49:54')
---
        ];

        // insert transaction
        if (!$this->transactionModel->insert($transaction)) {

INSERT INTO `transaction_detail` (`transaction_id`, `product_id`, `jumlah`, `diskon`, `subtotal_harga`, `created_at`, `updated_at`) VALUES (4, '1', 1, 0, 10899000, '2026-07-05 20:49:54', '2026-07-05 20:49:54')
---

        // insert transaction detail
        foreach ($cartItems as $item) {
            $this->transactionDetailModel->insert([
                'transaction_id' => $transactionId,
                'product_id'     => $item['id'],
                'jumlah'         => $item['qty'],
                'diskon'         => 0,
                'subtotal_harga' => $item['qty'] * $item['price']
            ]);

SELECT *
FROM `transaction`
WHERE `username` = 'cici82'
AND `transaction`.`deleted_at` IS NULL
---
    public function history()
    {
        $username = session()->get('username');

        $transactions = $this->transactionModel->where('username', $username)->findAll();